In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns
%matplotlib inline

from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix
from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import cross_val_score

In [2]:
df = pd.read_csv("train.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.drop(["PassengerId","Name", "SibSp", "Ticket", "Cabin", "Embarked"],axis="columns",inplace=True)

In [5]:
df.head()

   Survived  Pclass     Sex   Age  Parch     Fare
0         0       3    male  22.0      0   7.2500
1         1       1  female  38.0      0  71.2833
2         1       3  female  26.0      0   7.9250
3         1       1  female  35.0      0  53.1000
4         0       3    male  35.0      0   8.0500

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
dtypes: float64(2), int64(3), object(1)
memory usage: 41.9+ KB

In [7]:
df.describe()

         Survived      Pclass         Age       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.381594   32.204208
std      0.486592    0.836071   14.526497    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    6.000000  512.329200

In [8]:
df.head()

   Survived  Pclass     Sex   Age  Parch     Fare
0         0       3    male  22.0      0   7.2500
1         1       1  female  38.0      0  71.2833
2         1       3  female  26.0      0   7.9250
3         1       1  female  35.0      0  53.1000
4         0       3    male  35.0      0   8.0500

In [9]:
le_sex = LabelEncoder()

In [10]:
df["sex_n"] = le_sex.fit_transform(df["Sex"])

In [11]:
df.head()

   Survived  Pclass     Sex   Age  Parch     Fare  sex_n
0         0       3    male  22.0      0   7.2500      1
1         1       1  female  38.0      0  71.2833      0
2         1       3  female  26.0      0   7.9250      0
3         1       1  female  35.0      0  53.1000      0
4         0       3    male  35.0      0   8.0500      1

In [176]:
df.drop(["Sex"], axis="columns", inplace=True)

In [177]:
df.head()

   Survived  Pclass   Age  Parch     Fare Cabin Embarked  sex_n
0         0       3  22.0      0   7.2500   NaN        S      1
1         1       1  38.0      0  71.2833   C85        C      0
2         1       3  26.0      0   7.9250   NaN        S      0
3         1       1  35.0      0  53.1000  C123        S      0
4         0       3  35.0      0   8.0500   NaN        S      1

In [178]:
dummies = pd.get_dummies(df.Embarked)

In [179]:
df = pd.concat([df,dummies], axis="columns")

In [180]:
df.drop(["Embarked", "S"], axis="columns", inplace=True)

In [181]:
df.head()

   Survived  Pclass   Age  Parch     Fare Cabin  sex_n  C  Q
0         0       3  22.0      0   7.2500   NaN      1  0  0
1         1       1  38.0      0  71.2833   C85      0  1  0
2         1       3  26.0      0   7.9250   NaN      0  0  0
3         1       1  35.0      0  53.1000  C123      0  0  0
4         0       3  35.0      0   8.0500   NaN      1  0  0

In [182]:
df.isnull().sum()

Survived      0
Pclass        0
Age         177
Parch         0
Fare          0
Cabin       687
sex_n         0
C             0
Q             0
dtype: int64

In [183]:
df.Age.mean()

29.69911764705882

In [184]:
df["Age"].fillna(df.Age.mean(),inplace=True)

In [185]:
df.isnull().sum()

Survived      0
Pclass        0
Age           0
Parch         0
Fare          0
Cabin       687
sex_n         0
C             0
Q             0
dtype: int64

In [186]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Age       891 non-null    float64
 3   Parch     891 non-null    int64
 4   Fare      891 non-null    float64
 5   Cabin     204 non-null    object
 6   sex_n     891 non-null    int32
 7   C         891 non-null    uint8
 8   Q         891 non-null    uint8
dtypes: float64(2), int32(1), int64(3), object(1), uint8(2)
memory usage: 47.1+ KB

In [190]:
df["Cabin"] = df["Cabin"].apply(lambda i: str(i)[0] if i!=np.nan else i)

In [191]:
df["Cabin"]

0      n
1      C
2      n
3      C
4      n
      ..
886    n
887    B
888    n
889    C
890    n
Name: Cabin, Length: 891, dtype: object

#Let us make a smaller model to predict the cabin
A,B

In [192]:
df.drop("Cabin", axis="columns", inplace=True)

In [215]:
df.head()

   Survived  Pclass   Age  Parch     Fare  sex_n  C  Q
0         0       3  22.0      0   7.2500      1  0  0
1         1       1  38.0      0  71.2833      0  1  0
2         1       3  26.0      0   7.9250      0  0  0
3         1       1  35.0      0  53.1000      0  0  0
4         0       3  35.0      0   8.0500      1  0  0

In [216]:
df.drop(["C", "Q", "Parch"], axis="columns", inplace=True)

In [225]:
df.head()

   Survived  Pclass   Age     Fare  sex_n
0         0       3  22.0   7.2500      1
1         1       1  38.0  71.2833      0
2         1       3  26.0   7.9250      0
3         1       1  35.0  53.1000      0
4         0       3  35.0   8.0500      1

In [226]:
df.drop("Fare", axis="columns", inplace=True)

In [227]:
model = RandomForestClassifier(n_estimators=10)

In [228]:
Y = df["Survived"].values
X = df.drop("Survived", axis="columns")

In [229]:
X_train, X_test, Y_train, Y_test = train_test_split(X,Y,test_size=0.2)

In [230]:
model.fit(X_train,Y_train)

RandomForestClassifier(n_estimators=10)

In [231]:
model.score(X_test, Y_test)

0.7653631284916201

In [238]:
cross_val_score(RandomForestClassifier(n_estimators=8), X, Y, cv = 20).mean()

0.8114393939393938

In [239]:
cross_val_score(LogisticRegression(max_iter=1000), X, Y, cv = 10).mean()

0.7946192259675405

In [242]:
cross_val_score(DecisionTreeClassifier(), X, Y, cv = 30).mean()

0.8192720306513409

In [71]:
dff = pd.read_csv("test.csv")

In [72]:
dff.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [73]:
ids = dff["PassengerId"]

In [74]:
dff.drop(["PassengerId","Name", "Ticket", "Fare", "Cabin"],axis="columns",inplace=True)

In [75]:
le_sex = LabelEncoder()
le_emb = LabelEncoder()
dff["sex_n"] = le_sex.fit_transform(dff["Sex"])
dff["embarked_n"] = le_emb.fit_transform(dff["Embarked"])
dff.drop(["Sex", "Embarked"], axis="columns", inplace=True)
dff.fillna(dff.Age.mean(),inplace=True)

In [76]:
pred = model.predict(dff)

In [77]:
pred

array([0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1,
       1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1,
       0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1,
       0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1,
       0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1,
       0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1],
      dtype=int64)

In [78]:
res = pd.DataFrame(ids)

In [79]:
res["Survived"] = pred

In [80]:
res

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         1
4            896         0
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         1

[418 rows x 2 columns]

In [81]:
res.to_csv("predictions.csv",index=False)